
#include "include.h"
#include "stdio.h"

/*******************************************************************************
****函数名称:
****函数功能:延时函数
****版本:V1.0
****日期:14-2-2014
****入口参数:需要延时的数目
****出口参数:无
****说明:
********************************************************************************/
void Delay(uint16_t nCount)
{
  while (nCount != 0)
  {   
    nCount--;
  }  
}
/*******************************************************************************
****函数名称:
****函数功能:主函数
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:波特率9600，通过计算机串口(直接通过板子USB)向开发板发数据，开发板接收到
         之后会返回发送的数据
********************************************************************************/
void main(void)
{
  UART_Init(); //初始化UART
  
  Send_Str("STM8S UART 实验！\r\n");//发送字符串
  enableInterrupts(); //开启中断
  
 
  while (1)
  {
     
  }  
  
}



/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
