/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"

uint8_t HexTable[]={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
/*******************************************************************************
****函数名称:
****函数功能:初始化UART
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void UART_Init(void)
{
    UART1_DeInit();
    UART1_Init((u32)9600, UART1_WORDLENGTH_8D, UART1_STOPBITS_1, UART1_PARITY_NO, UART1_SYNCMODE_CLOCK_DISABLE, UART1_MODE_TXRX_ENABLE);
    UART1_ITConfig(UART1_IT_RXNE_OR, ENABLE);
    UART1_Cmd(ENABLE);
}
/*******************************************************************************
****函数名称:
****函数功能:发送8位数据
****版本:V1.0
****日期:14-2-2014
****入口参数:dat-需要发送的数据
****出口参数:无
****说明:
********************************************************************************/
void Send_Dat(u8 dat)
{
   while(( UART1_GetFlagStatus(UART1_FLAG_TXE)==RESET));
   UART1_SendData8(dat);
}
/*******************************************************************************
****函数名称:
****函数功能:发送Hex数据
****版本:V1.0
****日期:14-2-2014
****入口参数:dat-需要发送的数据
****出口参数:无
****说明:
********************************************************************************/
void Send_Hex(unsigned char dat)
{
   Send_Dat('0');
   Send_Dat('x');
   Send_Dat(HexTable[dat>>4]);
   Send_Dat(HexTable[dat&0x0f]);
   Send_Dat(' ');
}
/*******************************************************************************
****函数名称:
****函数功能:发送字符串
****版本:V1.0
****日期:14-2-2014
****入口参数:dat-需要发送的数据
****出口参数:无
****说明:
********************************************************************************/
void Send_Str(unsigned char *dat)
{
  while(*dat!='\0')
		
    {			
      Send_Dat(*dat);			
      dat++;	
    }
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/

void for_git_test()
{
	
	do
	{
		
		//i dont do nothing
		//i just fot test
		//it looks fun
		
	}while(1);
	
	
	
	
}